using System;

namespace Homework_task4
{
    /* Technical task
    
        Создайте текстовый файл-чек по типу «Наименование товара – 0.00(цена)грн.» с
        определенным количеством наименований товаров и датой совершения покупки. Выведите на
        экран информацию из чека в формате текущей локали пользователя и в формате локали
        en-US.
    */



    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
