using System;

namespace Homework_task3
{
    /* Technical task
    
        Напишите приложение для поиска заданного файла на диске. Добавьте код, использующий
        класс FileStream и позволяющий просматривать файл в текстовом окне. В заключение
        добавьте возможность сжатия найденного файла.
    */

    // I won't do it now because I need a lot of time to do it. When I do, I'll let you know.


    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
